<img src="https://raw.githubusercontent.com/dm-fedorov/pandas_basic/master/pic/currency_cleanup.png">

In [32]:
import numpy as np
import pandas as pd

pandas.read_excel(_io_, _sheet_name=0_, _*_, _header=0_, _names=None_, _index_col=None_, _usecols=None_, _dtype=None_, _engine=None_, _converters=None_, _true_values=None_, _false_values=None_, _skiprows=None_, _nrows=None_, _na_values=None_, _keep_default_na=True_, _na_filter=True_, _verbose=False_, _parse_dates=__False, date_parser=_NoDefault.no_default_, _date_format=None_, _thousands=None_, _decimal='.'_, _comment=None_, _skipfooter=0_, _storage_options=None_, _dtype_backend=_NoDefault.no_default_, _engine_kwargs=None_)


Read an Excel file into a `pandas` `DataFrame`.

Supports xls, xlsx, xlsm, xlsb, odf, ods and odt file extensions read from a local filesystem or URL. Supports an option to read a single sheet or a list of sheets.

In [33]:
df_orig = pd.read_excel(
    "https://github.com/dm-fedorov/pandas_basic/blob/master/%D0%B1%D1%8B%D1%81%D1%82%D1%80%D0%BE%D0%B5%20%D0%B2%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%B2%20pandas/data/sales_cleanup.xlsx?raw=True"
)
df = df_orig.copy()
df

         Customer      Sales
0  Jones Brothers        500
1       Beta Corp  $1,000.00
2     Globex Corp      300.1
3            Acme    $750.01
4         Initech        300
5           Hooli        250

DataFrame.info(_verbose=None_, _buf=None_, _max_cols=None_, _memory_usage=None_, _show_counts=None_)

Print a concise summary of a DataFrame.

This method prints information about a DataFrame including the index dtype and columns, non-null values and memory usage.

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Customer  6 non-null      object
 1   Sales     6 non-null      object
dtypes: object(2)
memory usage: 228.0+ bytes

Return the dtypes in the DataFrame.

This returns a Series with the data type of each column. The result’s index is the original DataFrame’s columns. Columns with mixed types are stored with the `object` dtype. See [the User Guide](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#basics-dtypes) for more.

In [35]:
df.dtypes

Customer    object
Sales       object
dtype: object

In [36]:
# df['Sales'].astype('float') astype- the method of data type transformation

DataFrame.astype(_dtype_, _copy=None_, _errors='raise'_)

Cast a pandas object to a specified dtype `dtype`.

**dtype**str, data type, Series or Mapping of column name -> data type

Use a str, numpy.dtype, pandas.ExtensionDtype or Python type to cast entire pandas object to the same type. Alternatively, use a mapping, e.g. {col: dtype, …}, where col is a column label and dtype is a numpy.dtype or Python type to cast one or more of the DataFrame’s columns to column-specific types.

**copy**bool, default True

Return a copy when `copy=True` (be very careful setting `copy=False` as changes to values then may propagate to other pandas objects).

In [37]:
df["Sales"] = df["Sales"].str.replace("$", "")
df["Sales"] = df["Sales"].str.replace(",", "")
df["Sales"]

# Next, we get rid of the $ sign and , use the replace method

0        NaN
1    1000.00
2        NaN
3     750.01
4        NaN
5        NaN
Name: Sales, dtype: object

In [38]:
df = df_orig.copy()
df["Sales"].apply(type)  # The type function is applied to each page

0      <class 'int'>
1      <class 'str'>
2    <class 'float'>
3      <class 'str'>
4      <class 'int'>
5      <class 'int'>
Name: Sales, dtype: object

There is another Pythonic use case for the __name__ attribute, another common usage pattern that employs __name__. This pattern I will teach you about now doesn't have to do with module attributes, but with object type attributes.

In [39]:
df["Sales_type"] = df["Sales"].apply(lambda x: type(x).__name__)
df

         Customer      Sales Sales_type
0  Jones Brothers        500        int
1       Beta Corp  $1,000.00        str
2     Globex Corp      300.1      float
3            Acme    $750.01        str
4         Initech        300        int
5           Hooli        250        int

In [40]:
class name:
    """
    # __init__ - the method is magical, it is called when an event occurs, triggers the creation of an object/ calls the method automatically when an object is created
    obj.__init__() -> you do not need to do this
    """

    def __init__(
        self, name, age
    ) -> (
        None
    ):  # non-resultant(void), it performs operations but does not display
        self.name1 = name
        self.age1 = age
        # obj.name = name
        # obj1.name = name


# obj = name()
# obj1 = name()
# obj.name = 1

In [41]:
obj = name("name", 23)  # creating an object
obj.age1

23

```python
DataFrame.value_counts(_subset=None_, _normalize=False_, _sort=True_, _ascending=False_, _dropna=True_)
```

Return a Series containing the frequency of each distinct row in the Dataframe.

In [42]:
# We have adopted the f type, counting these types, we use it often
df["Sales"].apply(type).value_counts()

Sales
<class 'int'>      3
<class 'str'>      2
<class 'float'>    1
Name: count, dtype: int64

In [43]:
number = 1235
number_string = "$1,235"
type(number), type(
    number_string
)  # for silence, " Jupiter appealed to the tuple" for silence","data transfer"," / returns the tuple (int, str)

(int, str)

In [44]:
dir(number_string.replace("$", ""))

# number = 1
# number + 1 => number.__add__(2)

['__add__',
 '__class__',
 '__contains__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__getnewargs__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__mul__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rmod__',
 '__rmul__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'capitalize',
 'casefold',
 'center',
 'count',
 'encode',
 'endswith',
 'expandtabs',
 'find',
 'format',
 'format_map',
 'index',
 'isalnum',
 'isalpha',
 'isascii',
 'isdecimal',
 'isdigit',
 'isidentifier',
 'islower',
 'isnumeric',
 'isprintable',
 'isspace',
 'istitle',
 'isupper',
 'join',
 'ljust',
 'lower',
 'lstrip',
 'maketrans',
 'partition',
 'removeprefix',
 'removesuffix',
 'replace',
 'rfind',
 'rindex',
 'rjust',
 'rpartition',
 'rsplit',
 'rstrip',
 'split',
 'splitlines',
 'startswith',
 'strip',
 'swapcase',
 'title',
 'translate',
 'upper',
 'zfill']

Deleting two items at once by calling two methods at the same time

In [45]:
float(number_string.replace("$", "").replace(",", ""))

# number_string.replace('$', '').replace(',', '').astype('float') # there is no attribute

1235.0

In [46]:
def clean_currency(x):
    """
    if the value is a page, then removes the currency symbol and the separator, otherwise, the value is a number
    """
    if isinstance(x, str):
        return x.replace("$", "").replace(",", "")
    return x


clean_currency.__doc__  # показывает докуметацию

'\n    if the value is a page, then removes the currency symbol and the separator, otherwise, the value is a number\n    '

In [47]:
list_ = [1, 2, 3]
list_1 = list_

list_ is list_1, id(list_) == id(list_1)  # variables refer to the same object

del list_
list_1  # the object exists, the garbage collection has not arrived

# garbage collection came and deleted the object from memory (memory optimization)
del list_1

We applied the above function to the entire column and also changed the type of its values

In [48]:
df["Sales"] = df["Sales"].apply(clean_currency).astype("float")
df["Sales"]

0     500.00
1    1000.00
2     300.10
3     750.01
4     300.00
5     250.00
Name: Sales, dtype: float64

In [49]:
df["Sales_type"] = df["Sales"].apply(lambda x: type(x).__name__)
df["Sales_type"]

0    float
1    float
2    float
3    float
4    float
5    float
Name: Sales_type, dtype: object

In [50]:
df

         Customer    Sales Sales_type
0  Jones Brothers   500.00      float
1       Beta Corp  1000.00      float
2     Globex Corp   300.10      float
3            Acme   750.01      float
4         Initech   300.00      float
5           Hooli   250.00      float

In [51]:
df.dtypes

Customer       object
Sales         float64
Sales_type     object
dtype: object

In [52]:
df["Sales"].apply(type).value_counts()

Sales
<class 'float'>    6
Name: count, dtype: int64

In [53]:
df = df_orig.copy()

Let's write the application of all the above operations on a column in one line

In [54]:
df["Sales"] = (
    df["Sales"]
    .apply(
        lambda x: x.replace("$", "").replace(",", "")
        if isinstance(x, str)
        else x
    )
    .astype("float")
)
df["Sales"]

0     500.00
1    1000.00
2     300.10
3     750.01
4     300.00
5     250.00
Name: Sales, dtype: float64

We will give the necessary changes in the form of a dictionary

In [55]:
df = df_orig.copy()
df

df["Sales"] = df["Sales"].replace({r"\$": "", ",": ""}, regex=True)

In [56]:
df.head()

         Customer    Sales
0  Jones Brothers      500
1       Beta Corp  1000.00
2     Globex Corp    300.1
3            Acme   750.01
4         Initech      300

In [57]:
df["Sales"].apply(type).value_counts()

Sales
<class 'int'>      3
<class 'str'>      2
<class 'float'>    1
Name: count, dtype: int64

In [58]:
# df = df_orig.copy()
# df['Sales'] = df['Sales'].str.replace(',','').str.replace('$','').astype('float')
# df['Sales']

In [59]:
df = pd.read_excel(
    "https://github.com/dm-fedorov/pandas_basic/blob/master/%D0%B1%D1%8B%D1%81%D1%82%D1%80%D0%BE%D0%B5%20%D0%B2%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%B2%20pandas/data/sales_cleanup.xlsx?raw=True",
    dtype={"Sales": str},
)
df.head()

         Customer      Sales
0  Jones Brothers        500
1       Beta Corp  $1,000.00
2     Globex Corp      300.1
3            Acme    $750.01
4         Initech        300

In [60]:
df["Sales"].apply(type).value_counts()

Sales
<class 'str'>    6
Name: count, dtype: int64

In [61]:
df["Sales"] = (
    df["Sales"].replace({r"\$": "", ",": ""}, regex=True).astype(float)
)
df["Sales"]

0     500.00
1    1000.00
2     300.10
3     750.01
4     300.00
5     250.00
Name: Sales, dtype: float64